app/Controllers/AdminController.php

SELECT *
FROM `usuarios`
---
    public function manageUsers()
    {
         if(!session()->get('logged_in') || session()->get('user_rol') !== 'admin'){
            return redirect()->to('/')->with('error', 'Acceso denegado.');
        }

        $usuariosModel = new UsuariosModel();
        $usuarios = $usuariosModel->findAll();

SELECT `productos`.*, `categoria`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
---
    $productosModel = new \App\Models\ProductosModel();
    $productosModel->insert($productoData);

    return redirect()->to('/Admin/manageStock')->with('success', 'Producto agregado correctamente.');

SELECT *
FROM `categoria`
SELECT `productos`.*, `categoria`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
---
    public function manageStock()
    {
        if(!session()->get('logged_in') || session()->get('user_rol') !== 'admin'){
            return redirect()->to('/')->with('error', 'Acceso denegado.');
        }

        $productosModel = new ProductosModel();
        $categoriaModel = new CategoriaModel();

        $categorias = $categoriaModel->findAll();

        $productos = $productosModel
            ->select('productos.*, categoria.nombre as categoria_nombre')
            ->join('categoria', 'categoria.id_categoria = productos.id_categoria')
            ->findAll();

SELECT *
FROM `categoria`
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '1'
---
    public function editar_producto($id=null){
        $producto = new ProductosModel();
        $categoria = new CategoriaModel();
        $data['categorias'] = $categoria->findAll();
        $data['producto'] = $producto->where('id_producto', $id)->first();