app/Controllers/Pages.php

SELECT *
FROM `categoria`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `id_categoria` = 1
AND `activo` = 1
SELECT `productos`.*, `categoria`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`activo` = '1'
---
    public function index()
    {
        $categoriaModel = new CategoriaModel();
        $categorias = $categoriaModel->where('activo', 1)->findAll();

        $session = session();
        $rol = $session->get('user_rol');
        $isLogged = $session->get('logged_in');

        $productosModel = new ProductosModel();
        $botines = $productosModel
        ->where('id_categoria', 1)
        ->where('activo', 1)
        ->findAll();

        $productosModel2 = new ProductosModel();
        $calzados = $productosModel2
        ->select('productos.*, categoria.nombre as categoria_nombre')
        ->join('categoria', 'categoria.id_categoria = productos.id_categoria')
        ->where('productos.activo', '1')
        ->findAll();