app/Controllers/ProductosController.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '1'
---
    public function show($id)
    {
        $productosModel = new ProductosModel();
        $producto = $productosModel->find($id);

        $producto = $productosModel
        ->select('productos.*, categoria.nombre as categoria_nombre')
        ->join('categoria', 'categoria.id_categoria = productos.id_categoria')
        ->where('productos.id_producto', $id)
        ->first();

        if(!$producto)
        {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Producto no encontrado.');
        }

        $session = session();
        $isAdmin = $session->get('user_rol') === 'admin';