app/Controllers/ProductosController.php

    public function show($id)
    {
        $productosModel = new ProductosModel();
        $producto = $productosModel->find($id);

        $producto = $productosModel
        ->select('productos.*, categoria.nombre as categoria_nombre')
        ->join('categoria', 'categoria.id_categoria = productos.id_categoria')
        ->where('productos.id_producto', $id)
        ->first();

        if(!$producto)
        {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Producto no encontrado.');
        }

        $session = session();
        $isAdmin = $session->get('user_rol') === 'admin';
---
SELECT `productos`.*, `categoria`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`id_producto` = '4'
 LIMIT 1
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'

    $productosModel->where('productos.activo', 1);

    $productos = $productosModel->findAll();
    $categorias = $categoriaModel->where('activo', 1)->findAll();
---
SELECT *
FROM `categoria`
WHERE `activo` = 1