app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
WHERE `email` = '123123@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        helper(['form']);

        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $model = new UsuariosModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();