app/Models/UsuariosModel.php

  public function obtenerUsuarioPorEmail($email){



    return $this->where('email',$email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = ''
 LIMIT 1